# AssemblyMemberDifferentCategory Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AssemblyMemberDifferentCategory Members
AssemblyMemberDifferentCategory Class Methods Properties See Also
---
The AssemblyMemberDifferentCategory type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | (Inherited from AssemblyMemberDifference.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| CategoryId1 | Category id of the first assembly member |
| CategoryId2 | Category id of the second assembly member |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from AssemblyMemberDifference.) |

# See Also
AssemblyMemberDifferentCategory Class
Autodesk.Revit.DB Namespace